# -*- coding: utf-8
#
# Программа к учебному пособию
# К.Ю. Поляков. Программирование на языках Python и C++
# Часть 2 (9 класс)
# Программа № 16. Преобразования строка-число
#

s = "123"
n = int( s )    	# n = 123
s = "123.456"
x = float( s ) 	# x = 123.456
print( n, x )

n = 123
sn = str( n )   # s = "123"
x = 123.456
sx = str( x )   # s = "123.456"
print( sn, sx )

n = 123
s = "{:5}".format(n)   # s = "  123"
print( s )

x = 123.456
s = "{:7.2f}".format(x)   # s = " 123.46"
print( s )
s = "{:10.2e}".format(x)  # s = "  1.23e+02"
print( s )




